#include <iostream>

int main()
{
	int ÁöºÒÇÒ±Ý¾×;
	std::cin >> ÁöºÒÇÒ±Ý¾×;

	int °Å½º¸§µ· = 1000 - ÁöºÒÇÒ±Ý¾×;

	int ÀÜµ·°³¼ö{ 0 };
	while (°Å½º¸§µ· >= 500)
	{
		°Å½º¸§µ· -= 500;
		ÀÜµ·°³¼ö++;
	}

	while (°Å½º¸§µ· >= 100)
	{
		°Å½º¸§µ· -= 100;
		ÀÜµ·°³¼ö++;
	}

	while (°Å½º¸§µ· >= 50)
	{
		°Å½º¸§µ· -= 50;
		ÀÜµ·°³¼ö++;
	}

	while (°Å½º¸§µ· >= 10)
	{
		°Å½º¸§µ· -= 10;
		ÀÜµ·°³¼ö++;
	}

	while (°Å½º¸§µ· >= 5)
	{
		°Å½º¸§µ· -= 5;
		ÀÜµ·°³¼ö++;
	}

	while (°Å½º¸§µ· >= 1)
	{
		°Å½º¸§µ· -= 1;
		ÀÜµ·°³¼ö++;
	}

	std::cout << ÀÜµ·°³¼ö;
}